cask_args appdir: '/Applications'
tap 'caskroom/fonts'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

# Homebrew
brew 'ack'
brew 'bash-completion'
brew 'bash'
brew 'curl'
brew 'ffmpeg'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'go'
brew 'htop-osx'
brew 'hub'
brew 'lesspipe'
brew 'man2html'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tree'
brew 'wget'
brew 'node'
brew 'yarn'
brew 'mas'

# PHP
brew 'php71', args: ['with-debug']
brew 'php71-xdebug'
brew 'mariadb'

# Casks
## Quicklook Generators
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'ttscoff-mmd-quicklook'

## Color Pickers
cask 'colorpicker-developer'
cask 'colorpicker-skalacolor'

## Apps
cask '1password'
cask 'acorn'
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'audio-hijack'
cask 'audiobook-builder'
cask 'backblaze'
cask 'bartender'
cask 'base'
cask 'battle-net'
cask 'bettertouchtool'
cask 'calibre'
cask 'cheatsheet'
cask 'chronosync'
cask 'clarify'
cask 'codekit'
cask 'coderunner'
cask 'daisydisk'
cask 'dash'
cask 'default-folder-x'
cask 'deluge'
cask 'devonthink-pro-office'
cask 'dropbox'
cask 'droplr'
cask 'fantastical'
cask 'firefox'
cask 'fission'
cask 'fluid'
cask 'google-chrome'
cask 'google-hangouts'
cask 'google-photos-backup'
cask 'hammerspoon'
cask 'hyperswitch'
cask 'istat-menus'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'kindle'
cask 'launchcontrol'
cask 'levelator'
cask 'little-snitch'
cask 'macvim'
cask 'marked'
cask 'mattermost'
cask 'metadatics'
cask 'moom'
cask 'mountain'
cask 'nvalt'
cask 'omnifocus'
cask 'omnigraffle'
cask 'path-finder'
cask 'paw'
cask 'pdfpenpro'
cask 'phpstorm'
cask 'powermate'
cask 'screenflow'
cask 'scrivener'
cask 'sequel-pro'
cask 'simple-comic'
cask 'skype'
cask 'slack-beta'
cask 'snagit'
cask 'soulver'
cask 'steam'
cask 'sublime-text'
cask 'superduper'
cask 'taskpaper'
cask 'textexpander'
cask 'the-unarchiver'
cask 'tower'
cask 'transmit'
cask 'panic-unison'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'vmware-fusion'
cask 'xld'

## Preference Panes
cask 'hazel'
cask 'rcdefaultapp'
cask 'witch'

## Fonts
cask 'font-anonymous-pro'
cask 'font-hack'
cask 'font-meslo-lg-for-powerline'
cask 'font-inconsolata'

# Mac App Store
mas 'Affinity Designer', id:824171161
mas 'Airmail 2', id:918858936
mas 'Amphetamine', id:937984704
mas 'Day One', id:1055511498
mas 'Deliveries', id:924726344
mas 'Due', id:524373870
mas 'FruitJuice', id:671736912
mas 'iFlicks 2', id:731062389
mas 'Keynote', id:409183694
mas 'Microsoft Remote Desktop', id:715768417
mas 'Murasaki', id:430300762
mas 'Numbers', id:409203825
mas 'Pages', id:409201541
mas 'Paprika Recipe Manager', id:451907568
mas 'Patterns', id:429449079
mas 'Pixelmator', id:407963104
mas 'Reeder', id:880001334
mas 'Shush', id:496437906
mas 'Sip', id: 507257563
mas 'Spillo', id:873245660
mas "Timing Automatic Time Tracker" id:431511738
mas 'Tweetbot', id:557168941
