cask_args appdir: '/Applications'
tap 'yt-dlp/taps'

# Homebrew
brew 'asimov' # ignore dev dependencies in TimeMachine
brew 'astroterm' # terminal planetarium
brew 'bat' # a better cat
brew 'composer' # PHP package manager
brew 'coreutils' # build tools
brew 'curl' # fetch stuff
brew 'eza' # a better ls
brew 'fd' # a better find
brew 'ffmpeg' # video/audio converter
brew 'fzf' # fuzzy find stuff
brew 'gcc' # compiler
brew 'git' # version control
brew 'git-delta' # a better diff for git
brew 'glow' # terminal markdown renderer
brew 'go' # go programming language
brew 'gotop' # a better top
brew 'hugo' # static site generator
brew 'hyfetch' # system info (neofetch replacement)
brew 'lazygit' # git tui
brew 'lnav' # log fine navigator
brew 'mas' # mac app store installer
brew 'multi-git-status' # check git status for multiple repos
brew 'neovim' # editor
brew 'node' # JS dev tool
brew 'pandoc' # document conversion
brew 'pastel' # color conversion
brew 'php' # programming language
brew 'prettyping' # a better ping
brew 'pure' # prompt
brew 'python@3' # programming language
brew 'ripgrep' # a faster grep
brew 'sqlite' # database
brew 'stow' # save and restore dotfiles
brew 'symfony-cli/tap/symfony-cli' # symfony cli
brew 'tldr' # summarize commands
brew 'trash' # rm but files go in trash
brew 'uv' # python package installer
brew 'tmux' # terminal mulitplexer
brew 'webp' # webp image format tools
brew 'wego' # terminal weather tool
brew 'wget' # fetch stuff
brew 'wtfutil' # terminal dashboard
brew 'yt-dlp' # youtube downloader
brew 'zoxide' # fast directory jumping
brew 'zsh-autosuggestions' # ZSH plugin
brew 'zsh-syntax-highlighting' # ZSH plugin
brew 'zsh-history-substring-search' # ZSH plugin

## Fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-symbols-only-nerd-font'

# Casks
## Apps
cask '1password' # Password manager
cask '1password-cli' # CLI access to 1Password
cask 'acorn' # image editor
cask 'alfred' # app launcher and more
cask 'anki' # flash cards
cask 'automounterhelper' # helper for Automounter from MAS (must run to install)
cask 'bartender' # manage menu bar apps
cask 'bettertouchtool' # automation tool
cask 'calibre' # ebook manager
cask 'carbon-copy-cloner' # full disk backup
cask 'chatgpt' # ChatGPT access
cask 'cleanshot' # Screen shot tool
cask 'curseforge' # Minecraft mods
cask 'discord' # social chat
cask 'downie' # download manager
cask 'elgato-stream-deck' # Stream Deck software
cask 'elgato-wave-link' # Wave link microphone software
cask 'ghostty' # Terminal
cask 'hazel' # folder/file automation
cask 'istat-menus' # show computer data in menubar
cask 'jetbrains-toolbox' # Manage JetBrains software
cask 'kaleidoscope' # Diff tool
cask 'keyboard-maestro' # Automation tool
cask 'kindavim' # Add vim to all apps
cask 'lasso' # window manager
cask 'latest' # track app updates
cask 'lm-studio' # local LLMs
cask 'lookaway' # Ergonomic software
cask 'macwhisper' # transcribe audio
cask 'minecraft' # Minecraft
cask 'obsidian' # note manager
cask 'orion' # browser
cask 'pastebot' # clipboard manager
cask 'private-internet-access' # VPN software
cask 'rocket' # :emoji shortcodes everywhere
cask 'shortcat' # Accessibility software
cask 'slack' # team chat
cask 'soundsource' # audio improver
cask 'steam' # games!
cask 'telegram' # communications
cask 'transmission' # Torrent software
cask 'transmit' # FTP
cask 'typinator' # text expansions
cask 'visual-studio-code' # code editor
cask 'vlc' # video player

# Mac App Store

mas 'Actions for Obsidian', id: 1659667937 # shortcuts actions for obsidian
mas 'Amperfy', id: 1530145038 # Novidrome client
mas 'Amphetamine', id: 937984704 # prevent computer from sleeping
mas 'Automounter', id: 1160435653 # keep remote shares mounted
mas 'DaisyDisk', id: 411643860 # disk usage listing
mas 'Everlog', id: 1519935634 # journaling
mas 'Fantastical', id: 975937182 # better calendar
mas 'GoodLink', id: 1474335294 # read later app
mas 'Hand Mirror', id: 1502839586 # use webcam as a mirror
mas 'iFlicks', id: 1274494218 # video converter
mas 'Keka', id: 470158793 # archive software
mas 'Metadatics', id: 554883654 # mp3 tagger
mas 'Numbers', id: 409203825 # spreadsheet
mas 'OmniFocus', id: 1542143627 # task manager
mas 'Paprika Recipe Manager', id: 1303222628 # recipe manager
mas 'Play', id: 1596506190 # youtube video manager
mas 'Simple Comic', id: 1497435571 # comic book reader
mas 'Subtrack', id: 1519946553 # recurring expense tracker
mas 'TestFlight', id: 899247664 # beta testing app
mas 'Windows App', id: 1295203466 # Microsoft remote desktop
mas 'Xcode', id: 497799835 # Mac IDE

### Finder Preview / Quicklook Extensions

mas 'Folder Preview', id: 6698876601 # show folder contents in quicklook
mas 'Peek', id: 1554235898 # add features to quicklook

### Safari Extensions

mas '1Blocker', id: 1365531024 # Safari extension - ad blocking
mas '1Password for Safari', id: 1569813296 # Safari extension - integrate 1Password
mas 'Banish', id: 1639049780 # Safari extension - hide "open in app" banners
mas 'Eat the Shorts' id: 1668012393 # Safari extension - hides shorts on youtube (does seem available anymore)
mas 'Hush', id: 1544743900 # Safari extension - block cookie banners
mas 'Kagi for Safari', id: 1622835804 # Safari extension - set Kagi as search engine
mas 'Obsidian Web Clipper', id: 6720708363 # Safari extension - clip webpages to obsidian
mas 'Sink It', id: 6449873635 # Safari extension - reddit enhancements
mas 'StopTheMadness Pro', id: 6471380298 # Safari extension - stop website annoyances
mas 'Surfed', id: 1591590700 # Safari extension - unified browsing history
mas 'Vidimote', id: 1585702412 # Safari extension - video manager

