cask_args appdir: '/Applications'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'buo/cask-upgrade'

# Homebrew
brew 'ack'
brew 'bat'
brew 'curl'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'hugo'
brew 'jq'
brew 'lesspipe'
brew 'm-cli'
brew 'm4b-tool'
brew 'mas'
brew 'mplayer'
brew 'mycli'
brew 'ncdu'
brew 'neofetch'
brew 'node'
brew 'pandoc'
brew 'prettyping'
brew 'progress'
brew 'python3'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby-build'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'stormssh'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'

# PHP
brew 'php'
brew 'composer'
brew 'mariadb', restart_service: :changed

# Casks
## Apps
cask '1password'
cask 'acorn'
cask 'aerial'
cask 'alfred'
cask 'anki'
cask 'audio-hijack'
cask 'backblaze'
cask 'bartender'
cask 'base'
cask 'bettertouchtool'
cask 'calibre'
cask 'cardhop'
cask 'coderunner'
cask 'daisydisk'
cask 'dash'
cask 'default-folder-x'
cask 'devonthink-pro-office'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'firefox'
cask 'fission'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'keyboard-maestro'
cask 'kindle'
cask 'little-snitch'
cask 'markdown-service-tools'
cask 'marked'
cask 'metadatics'
cask 'mountain'
cask 'omnifocus'
cask 'omnigraffle'
cask 'paragon-ntfs'
cask 'path-finder'
cask 'pdfpenpro'
cask 'private-internet-access'
cask 'sequel-pro'
cask 'simple-comic'
cask 'skype'
cask 'soulver'
cask 'soundsource'
cask 'sublime-text'
cask 'superduper'
cask 'textexpander'
cask 'the-unarchiver'
cask 'tower'
cask 'transmission'
cask 'transmit'
cask 'vlc'
cask 'vmware-fusion10'

## Preference Panes
cask 'hazel'
cask 'rcdefaultapp'

## Fonts
cask 'font-anonymous-pro'
cask 'font-anonymouspro-nerd-font'
cask 'font-hack'
cask 'font-inconsolata'

## Driver
cask 'yubico-yubikey-piv-manager'

## Quicklook Generators
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'ttscoff-mmd-quicklook'

## Color Pickers
cask 'colorpicker-developer'
cask 'colorpicker-skalacolor'

# Mac App Store
mas '1Blocker - Block ads, tracking scripts, anything', id:1107421413
mas 'Affinity Designer', id:824171161
mas 'Amphetamine', id:937984704
mas 'Day One', id:1055511498
mas 'Deliveries', id:924726344
mas 'Drafts', id:1435957248
mas 'Due', id:524373870
mas 'Home Inventory', id:413564952
mas 'iFlicks 2', id:731062389
mas 'Microsoft Remote Desktop 10', id:1295203466
mas 'Numbers', id:409203825
mas 'Paprika Recipe Manager', id:451907568
mas 'Patterns', id:429449079
mas 'Reeder 4', id:1449412482
mas 'Retroclip', id:1332064978
mas 'Shush', id:496437906
mas 'StopTheMadness', id:1376402589
