cask_args appdir: '/Applications'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'

# Additional Brews
brew 'ffmpeg'
brew 'm4b-tool'
brew 'mplayer'


# Casks
## Apps
cask 'acorn'
cask 'aerial'
cask 'anki'
cask 'audio-hijack'
cask 'backblaze'
cask 'bartender'
cask 'base'
cask 'calibre'
cask 'cardhop'
cask 'coderunner'
cask 'daisydisk'
cask 'default-folder-x'
cask 'dropbox'
cask 'fantastical'
cask 'fission'
cask 'google-chrome'
cask 'istat-menus'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'kindle'
cask 'little-snitch'
cask 'markdown-service-tools'
cask 'marked'
cask 'metadatics'
cask 'mountain'
cask 'omnigraffle'
cask 'paragon-ntfs'
cask 'path-finder'
cask 'pdfpenpro'
cask 'sequel-pro'
cask 'simple-comic'
cask 'skype'
cask 'soulver'
cask 'soundsource'
cask 'superduper'
cask 'the-unarchiver'
cask 'tower2'
cask 'transmission'
cask 'transmit'
cask 'vlc'
cask 'vmware-fusion10'

## Preference Panes
cask 'hazel'
cask 'rcdefaultapp'

## Fonts
cask 'font-inconsolata'

# Mac App Store
mas '1Blocker - Block ads, tracking scripts, anything', id:1107421413
mas 'Affinity Designer', id:824171161
mas 'Deliveries', id:924726344
mas 'Home Inventory', id:413564952
mas 'iFlicks 2', id:731062389
mas 'Paprika Recipe Manager', id:451907568
mas 'Reeder 4', id:1449412482
mas 'Retroclip', id:1332064978
mas 'Shush', id:496437906
mas 'StopTheMadness', id:1376402589
